Revit 2022 API
SetupEnergySimulationDialog.Show Method
 Shows the SetupEnergySimulationDialog to the user as a modal dialog.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2016
Syntax
C#
public SetupEnergySimulationDialogResult Show()
Visual Basic
Public Function Show As SetupEnergySimulationDialogResult
Visual C++
public:
SetupEnergySimulationDialogResult Show()
Return Value
 One of the SetupEnergySimulationDialogResult values.
See Also
SetupEnergySimulationDialog Class
Autodesk.Revit.UI Namespace